cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'

# Kommandozeilen-Tools
brew 'wget'
brew 'yt-dlp'
brew 'ffmpeg'
brew 'tailscale'
brew 'languagetool'
brew 'r'
brew 'python'
brew 'postgresql@14'
brew 'pandoc'
brew 'neovim'
brew 'mas'

# Auskommentierte Kommandozeilen-Tools
# brew 'cloudflared'
# brew 'imagemagick'
# brew 'redis'
# brew 'ruby-build'
# brew 'spaceman-diff'
# brew 'spark'
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'

# Anwendungen
cask '1password'
cask 'alfred'
cask 'termius'
cask 'obsidian'
cask 'rectangle'
cask 'musescore'
cask 'ghostty'
cask 'zotero'
cask 'microsoft-office'
cask 'rstudio'
cask 'visual-studio-code'
cask 'intellij-idea'
cask 'jetbrains-toolbox'
cask 'arc'
cask 'google-chrome'
cask 'firefox'
cask 'vlc'
cask 'plex'
cask 'handbrake'
cask 'transmission'
cask 'whatsapp'
cask 'zoom'
cask 'quarto'
cask 'mactex'
cask 'google-drive'
cask 'jordanbaird-ice'

# Auskommentierte Anwendungen
# cask 'airtable'
# cask 'android-platform-tools'
# cask 'arq'
# cask 'diffusionbee'
# cask 'messenger'
# cask 'notion-calendar'
# cask 'sonos'
# cask 'raycast'
# cask 'warp'
# cask 'zed'

# Adobe-Produkte
cask 'adobe-creative-cloud'
cask 'adobe-acrobat-pro'
