cask_args appdir: '/Applications'

# Taps
# tap 'homebrew/bundle' # Homebrew bundle support

# Command-line tools
# brew 'cloudflared'        # Cloudflare tunnel client
# brew 'docker'              # docker dont keep both the cli and desktop version at the same time
brew 'ffmpeg'              # Multimedia framework for video/audio processing
brew 'languagetool'        # Grammar and spell checker
brew 'mas'                 # macOS App Store CLI
# brew 'neovim'              # Modern Vim-based text editor
# brew 'node'                # Installs node and expo tools
brew 'pandoc'              # Universal document converter
# brew 'postgresql@14'       # PostgreSQL database system
brew 'python'              # Python programming language
brew 'r'                   # R programming language for statistics
# brew 'redis'              # In-memory database
# brew 'ruby-build'          # Ruby version management tool
# brew 'spaceman-diff'      # Git diff viewer
# brew 'supabase'            # supabase cli
# brew 'spark'               # Visualization tool for shell
# brew 'tailscale'          # VPN service (app version preferred)
brew 'wget'                # Command-line file downloader
brew 'yt-dlp'              # YouTube and media downloader
# brew 'imagemagick'        # Image manipulation software
brew 'xcodes'              # xcode tooling
# Productivity applications
# cask '1password'            # Password manager
# cask 'airtable'            # Database/spreadsheet hybrid
cask 'alfred'               # Productivity launcher
# cask 'arq'                 # Backup solution
# cask 'dropzone'            # Drag-and-drop automation tool
cask 'github'               # Github Desktop interface
cask 'google-drive'         # Cloud storage
# cask 'notion-calendar'     # Notion-integrated calendar
cask 'mathpix-snipping-tool' # Convert images of equations into LaTeX
cask 'proton-pass'          # Proton pass GUI
cask 'proton-mail-bridge'   # Securely connecting mail clients to proton mail
cask 'quarto'               # Publishing system for documents and notebooks
cask 'rectangle'            # Window management
cask 'zotero'               # Reference manager

# Development tools
# cask 'android-platform-tools' # ADB & fastboot for Android
# cask 'android-studio'       # Android development
cask 'cursor'               # AI-powered code editor
# cask 'docker'               # Docker desktop
# cask 'expo-orbit'           # Development tool for Expo projects
cask 'ghostty'              # Fast terminal emulator
# cask 'intellij-idea'         # JetBrains IDE for Java
# cask 'jetbrains-toolbox'     # JetBrains tool manager
# cask 'raycast'               # Spotlight alternative with extensions
cask 'rstudio'              # IDE for R programming
# cask 'warp'                  # Modern terminal emulator
# cask 'visual-studio-code'   # Popular code editor
# cask 'zed'                   # Developer-focused text editor

# Media & entertainment applications
# cask 'diffusionbee'        # AI image generation tool
cask 'mactex'               # TeX distribution for macOS
# cask 'musescore'            # Music notation software
# cask 'plex'                 # Media server
# cask 'sonos'               # Controller for Sonos speakers
cask 'spotify'              # Music Streaming Service
# cask 'steam'                # Game library
cask 'vlc'                  # Media player

# Browsers & communication
# cask 'arc'                 # Chromium-based browser
cask 'google-chrome'        # Web browser
# cask 'firefox'             # Open-source web browser
# cask 'messenger'           # Facebook Messenger app
cask 'whatsapp'             # Messaging application
# cask 'zen-browser'          # Privacy-focused browser
# cask 'zoom'                 # Video conferencing

# System & utilities
# cask 'caffeine'             # Prevents macOS from sleeping
# cask 'jordanbaird-ice'      # Menu Bar setting
cask 'bartender'            # Menu Bar organisation
cask 'termius'              # SSH client
cask 'transmission'         # BitTorrent client
cask 'logi-options+'
cask 'unnaturalscrollwheels'

# Adobe products
# cask 'adobe-acrobat-pro'    # PDF reader and editor
# cask 'adobe-creative-cloud' # Adobe suite manager
