cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle' # Homebrew bundle support

# Command-line tools
# brew 'cloudflared'        # Cloudflare tunnel client
brew 'ffmpeg'              # Multimedia framework for video/audio processing
brew 'languagetool'        # Grammar and spell checker
brew 'mas'                 # macOS App Store CLI
brew 'neovim'              # Modern Vim-based text editor
brew 'pandoc'              # Universal document converter
brew 'postgresql@14'       # PostgreSQL database system
brew 'python'              # Python programming language
brew 'r'                   # R programming language for statistics
# brew 'redis'              # In-memory database
# brew 'ruby-build'         # Ruby version management tool
# brew 'spaceman-diff'      # Git diff viewer
# brew 'spark'              # Visualization tool for shell
# brew 'tailscale'          # VPN service (app version preferred)
brew 'wget'                # Command-line file downloader
brew 'yt-dlp'              # YouTube and media downloader
# brew 'imagemagick'        # Image manipulation software

# Productivity applications
cask '1password'            # Password manager
# cask 'airtable'            # Database/spreadsheet hybrid
cask 'alfred'               # Productivity launcher
# cask 'arq'                 # Backup solution
# cask 'dropzone'            # Drag-and-drop automation tool
cask 'google-drive'         # Cloud storage
# cask 'notion-calendar'     # Notion-integrated calendar
cask 'mathpix-snipping-tool' # Convert images of equations into LaTeX
cask 'quarto'               # Publishing system for documents and notebooks
cask 'rectangle'            # Window management
cask 'zotero'               # Reference manager

# Development tools
# cask 'android-platform-tools' # ADB & fastboot for Android
cask 'cursor'               # AI-powered code editor
cask 'expo-orbit'           # Development tool for Expo projects
cask 'ghostty'              # Fast terminal emulator
# cask 'intellij-idea'         # JetBrains IDE for Java
# cask 'jetbrains-toolbox'     # JetBrains tool manager
# cask 'raycast'               # Spotlight alternative with extensions
cask 'rstudio'              # IDE for R programming
# cask 'warp'                  # Modern terminal emulator
cask 'visual-studio-code'   # Popular code editor
# cask 'zed'                   # Developer-focused text editor

# Media & entertainment applications
# cask 'diffusionbee'        # AI image generation tool
cask 'handbrake'            # Video transcoder
cask 'mactex'               # TeX distribution for macOS
# cask 'musescore'            # Music notation software
cask 'plex'                 # Media server
# cask 'sonos'               # Controller for Sonos speakers
cask 'vlc'                  # Media player

# Browsers & communication
# cask 'arc'                 # Chromium-based browser
cask 'google-chrome'        # Web browser
# cask 'firefox'             # Open-source web browser
# cask 'messenger'           # Facebook Messenger app
cask 'whatsapp'             # Messaging application
cask 'zen-browser'          # Privacy-focused browser
cask 'zoom'                 # Video conferencing

# System & utilities
cask 'caffeine'             # Prevents macOS from sleeping
# cask 'netbirdio/tap/netbird-ui' # VPN management UI
cask 'jordanbaird-ice'      # Windows-like window snapping
cask 'termius'              # SSH client
cask 'transmission'         # BitTorrent client

# Adobe products
cask 'adobe-acrobat-pro'    # PDF reader and editor
cask 'adobe-creative-cloud' # Adobe suite manager
